home-environments/files/.config/emacs/modules/org-config.org
My old configurations for .org files.

I am no longer really using .org files except
* Org Modern
(provide 'org-modern-config)
(require 'org-modern)

(with-eval-after-load 'org (global-org-modern-mode))

(setq
 ;; Edit settings
 org-auto-align-tags nil
 org-tags-column 0
 org-catch-invisible-edits 'show-and-error
 org-special-ctrl-a/e t
 org-insert-heading-respect-content t

 ;; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
 org-ellipsis "…"

 ;; Agenda styling
 org-agenda-tags-column 0
 org-agenda-block-separator ?─
 org-agenda-time-grid
 '((daily today require-timed)
   (800 1000 1200 1400 1600 1800 2000)
   " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
 org-agenda-current-time-string
 "◀── now ─────────────────────────────────────────────────")

* Org Noter
(provide 'org-noter-config)

;;(add-to-list 'load-path "~/Projects/org-noter")
(require 'org-noter)

;; Org-noter
  (setq org-noter-doc-split-fraction '(0.7 . 0.7)
        org-noter-hide-other nil
        org-noter-always-create-frame nil
	)


(defun my-org-noter-insert-heading-hook ()
  (select-window (frame-first-window)))

(add-hook 'org-noter-insert-heading-hook 'my-org-noter-insert-heading-hook)


* Org Present

(provide 'org-present-conf)
(require 'org-present)
(require 'visual-fill-column)

;; Configure fill width
(setq visual-fill-column-width 110
      visual-fill-column-center-text t)


(defun my/org-present-prepare-slide (buffer-name heading)
  ;; Show only top-level headlines
  (org-overview)

  ;; Unfold the current entry
  (org-show-entry)

  ;; Show only direct subheadings of the slide but don't expand them
  (org-show-children))

(defun my/org-present-start ()
  ;; Tweak font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 4.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))

  ;; Set a blank header line string to create blank space at the top
  (setq header-line-format " ")

  ;; Display inline images automatically
  (org-display-inline-images)

  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun my/org-present-end ()
  ;; Reset font customizations
  (setq-local face-remapping-alist '((default variable-pitch default)))

  ;; Clear the header line string so that it isn't displayed
  (setq header-line-format nil)

  ;; Stop displaying inline images
  (org-remove-inline-images)

  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))

;; Turn on variable pitch fonts in Org Mode buffers
(add-hook 'org-mode-hook 'variable-pitch-mode)

;; Register hooks with org-present
(add-hook 'org-present-mode-hook 'my/org-present-start)
(add-hook 'org-present-mode-quit-hook 'my/org-present-end)
(add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)


* Org Babel
(provide 'org-babel)
;(require 'ess-site)

;; Do not ask for confirmation
(setq org-confirm-babel-evaluate nil)

;; Syntax latex
(require 'engrave-faces)
(setq org-latex-src-block-backend 'engraved)
(setq org-latex-engraved-theme t)  

(setq org-babel-python-command "python3")

(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   ;; other languages you want to enable, e.g.,
   (python . t)
   ))
* General org config
(provide 'org-config)

;; Always display images
(setq org-startup-with-inline-images t)

;; HTML export
;; Load the publishing system
(add-to-list 'load-path "~/Projects/org-html-themify")

(setq org-startup-indented t
      org-pretty-entities t
      ;; show actually italicized text instead of /italicized text/
      org-hide-emphasis-markers t
      org-agenda-block-separator ""
      org-fontify-whole-heading-line t
      org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t)




(require 'org-html-themify)

(setq org-html-themify-themes
      '((dark . doom-oceanic-next)
        (light . modus-operandi)))

(add-hook 'org-mode-hook 'org-html-themify-mode)
(require 'htmlize)
(require 'ox-publish)

      ;;   ;; Customize the HTML output
      ;;   (setq org-html-validation-link nil            ;; Don't show validation link
      ;;         org-html-head-include-scripts nil       ;; Use our own scripts
      ;;         org-html-head-include-default-style nil ;; Use our own styles
      ;; org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")

              ;org-html-head "<link href=\"https://taopeng.me/org-notes-style/css/notes.css\" rel=\"stylesheet\" type=\"text/css\" />")


         ;; Define the publishing project
        (setq org-publish-project-alist
              (list
               (list "org-site:main"
                     :recursive t
                     :base-directory "./content"
                     :publishing-function 'org-html-publish-to-html
                     :publishing-directory "./public"
                     :with-author nil           ;; Don't include author name
                     :with-creator t            ;; Include Emacs and Org versions in footer
                     :with-toc t                ;; Include a table of contents
                     :section-numbers nil       ;; Don't include section numbers
                     :time-stamp-file nil)))    ;; Don't include time stamp in file

        ;; Generate the site output
        (org-publish-all t)

